<script setup>
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger
} from '@/components/ui/accordion'

const faqItems = [
  {
    value: 'item-1',
    title: 'Как работает система замков NFCKEY?',
    content:
      'В основе работы замка и мобильного приложения лежит технология NFC, которая обеспечивает безопасный обмен данными при приближении устройства. После проверки зашифрованного цифрового ключа и всех необходимых разрешений механизм замка открывает дверь.'
  },
  {
    value: 'item-2',
    title: 'Замок может помочь, если я сдаю в аренду свою квартиру?',
    content:
      'Да, конечно. Вы можете создавать и отправлять ключи вашим арендаторам в нашем приложении, а после их выселения ключ можно удалить.'
  },
  {
    value: 'item-3',
    title: 'Как NFCKEY обеспечивает безопасность моей квартиры?',
    content:
      '<p>Для обеспечения безопасности в системе NFCKEY используются современные и проверенные технологии шифрования данных. Доступ к двери могут получить только авторизованные пользователи, имеющие соответствующий цифровой ключ в приложении NFCKEY.</p><br><p>С точки зрения механической защиты, решение не уступает обычным дверным замкам и обеспечивают схожий уровень защиты.</p>'
  },
  {
    value: 'item-4',
    title: 'Как мне начать пользоваться системой NFCKEY?',
    content:
      '<p>Начало работы с NFCKEY очень простое и понятное. После монтажа замка и установки батареек выполните следующие действия:</p><ol><li>Загрузите приложение NFCKEY из магазина приложений вашего устройства.</li><li>Зарегистрируйте учетную запись в приложении, указав свои данные.</li><li>Добавьте свой замок NFCKEY в приложение, введя код из комплекта поставки замка.</li><li>Настройте права доступа для себя, членов семьи, друзей или всех, кому необходим доступ к вашему помещению.</li></ol><p>Теперь вы готовы к использованию системы NFCKEY. Для получения доступа просто поднесите смартфон к замку. Также рекомендуем ознакомиться с возможностями, предоставляемыми при оформлении премиум-подписки.</p>'
  },
  {
    value: 'item-5',
    title: 'Можно ли устанавливать замки NFCKEY в различные типы дверей?',
    content:
      '<p>Да, замки NFCKEY разработаны таким образом, чтобы быть универсальными и адаптироваться к различным типам дверей. Они также подходят как для жилых, так и для коммерческих помещений, что делает их универсальным выбором для обеспечения безопасности широкогоспектра помещений.</p><br><p>Если у вас есть конкретные вопросы или требования к установке, мы всегда готовы помочь вам в обеспечении беспроблемного процесса установки.</p>'
  },
  {
    value: 'item-6',
    title: 'Насколько сложно установить замок NFCKEY?',
    content:
      '<p>Простота установки замков NFCKEY зависит от типа выбранного вами замка:</p><ul><li>Накладной замок. Установка накладного замка является относительно простым процессом, но обычно требует использования дрели В руководстве, прилагаемом к замку, содержатся пошаговые инструкции по установке.</li><li>Врезной замок. Установка врезного замка, хотя и является более надежной и универсальной, может быть несколько сложнее. Для установки большинства врезных замков мы рекомендуем обратиться к квалифицированному слесарю или профессиональному монтажнику. Однако к каждому врезному замку прилагается подробное руководство, позволяющее технически подкованным людям самостоятельно справиться с установкой.</li></ul><p>Мы стараемся предоставить в наших руководствах четкие рекомендации, чтобы помочь в процессе установки и обеспечить надежную и правильную установку замка NFCKEY. Если у вас возникнут вопросы или сомнения по установке, пожалуйста, обращайтесь за помощью в нашу службу поддержки.</p>'
  },
  {
    value: 'item-7',
    title: 'Чем NFCKEY отличается от конкурентов?',
    content: `Для детального сравнения NFCKEY с конкурентами приглашаем вас посетить нашу специальную <a href="/infographics" target="_blank">страницу с инфографикой</a>, которая подчеркивает ключевые особенности и преимущества нашей системы. Благодаря ней вы точно сможете узнать все тонкости рынка и выбрать для себя подходящий вариант.`
  },
  {
    value: 'item-8',
    title: 'Каково время автономной работы замков NFCKEY?',
    content:
      '<p>Замки NFCKEY рассчитаны на длительное время автономной работы для обеспечения надежной работы. Конкретный срок службы батарей может варьироваться в зависимости от их производителя, но в среднем вы можете рассчитывать на срок службы в размере одного года.</p><br><p>Когда приходит время замены батареек, замок заранее уведомит вас об этом при помощи звуковых сигналов. Также вы сможете узнать об этом в мобильном приложении при очередном открытии двери.</p><br><p>Замена батареек не представляет собой сложного процесса и может быть выполнена с использованием пальчиковых батареек (АА). Подробные инструкции по замене можно найти в руководстве пользователя NFCKEY или в разделе поддержки на нашем сайте.</p>'
  },
  {
    value: 'item-9',
    title: 'Могут ли дети пользоваться замками NFCKEY?',
    content:
      '<p>Да, замки NFCKEY – это безопасное и удобное решение для пользователей всех возрастов, включая детей. Одним из преимуществ нашей системы является то, что основной способ открытия замка исключает использование физических ключей, которые можно легко потерять. Дети могут получить доступ к помещению, просто прислонив телефон к замку, при условии, что у них есть авторизованный цифровой ключ в приложении NFCKEY.</p><br><p>Даже если ребенок потеряет телефон, несанкционированный доступ будет практически невозможен, поскольку для работы приложения и разблокировки двери потребуется знание пароля телефона. Таким образом вам не придется переживать за потерю ключа, а в дополнение вы сможете получать уведомление, когда ребенок будет возвращаться домой.</p>'
  },
  {
    value: 'item-10',
    title: 'Доступно ли приложение NFCKEY для моего смартфона?',
    content:
      '<p class="neutral400 para-sm font-normal">Приложение NFCKEY разработано с учетом совместимости с широким спектром современных смартфонов, однако имеются определенные требования, с которыми вам следует ознакомиться:</p><ul><li class="neutral400 para-sm font-normal">Устройство должно обладать поддержкой технологии NFC, доступной в большинстве современных смартфонов;</li><li class="neutral400 para-sm font-normal">Для регистрации и обеспечения полной функциональности приложения необходимо интернет-соединение. Функции открытия двери будут доступны без интернет-соединения;</li><li class="neutral400 para-sm font-normal">Устройство должно работать под управлением Android 8.1 (Oreo) или более поздней версии, либо под управлением iOS 15.0 или более поздней версии для моделей смартфонов от Apple.</li></ul><p>Приложение доступно для устройств на базе Android и iOS, поэтому вы можете загрузить его из Google Play Store или Apple App Store, в зависимости от операционной системы вашего смартфона. Обязательно уточните характеристики вашего устройства у производителя или в приложении “Настройки”.</p>'
  },
  {
    value: 'item-11',
    title: 'Поддерживает ли NFCKEY смарт-часы?',
    content:
      'Мы понимаем растущий спрос на совместимость приложений со смарт-часами. В настоящее время поддержка недоступна, однако наша команда уже активно работает над реализацией подобной интеграции. Мы стремимся развивать наш продукт и предоставить вам еще более удобные возможности доступа. Следить за нашими анонсами и обновлениями вы можете в наших социальных сетях и на сайте.'
  },
  {
    value: 'item-12',
    title: 'Как NFCKEY упрощает процесс заселения и выселения для моих гостей?',
    content:
      '<p>NFCKEY позволяет отправлять гостям защищенные цифровые ключи через наше мобильное приложение. Гости получают доступ к квартире с помощью своих смартфонов. Все происходит дистанционно.</p><br><p>Вы самостоятельно настраиваете время действия ключа и можете менять время заселения и выезда гостей.</p>'
  },
  {
    value: 'item-13',
    title: 'Могу ли я удаленно контролировать доступ к моей недвижимости с помощью NFCKEY?',
    content:
      'Да, можете! NFCKEY предоставляет журнал доступа в режиме реального времени, позволяя вам отслеживать, когда гости входят и выходят. Кроме того, с помощью нашего мобильного приложения вы можете удаленно блокировать доступ пользователям, обеспечивая безопасность и удобство из любого места.'
  },
  {
    value: 'item-14',
    title: 'Как мне начать пользоваться NFCKEY в роли арендодателя?',
    content:
      'Начать работу с NFCKEY очень просто! После приобретения замка и его активации в приложении, изучите варианты подписки и выберите для себя тарифный план, который соответствует вашим требованиям.</p>'
  },
  {
    value: 'item-15',
    title: 'Могу ли я управлять арендой сразу нескольких объектов недвижимости?',
    content:
      'Да, NFCKEY может обслуживать несколько объектов недвижимости под одним аккаунтом. Вы можете легко добавлять или удалять замки по мере необходимости.'
  },
  {
    value: 'item-16',
    title: 'Какие гарантии предоставляет NFCKEY?',
    content:
      'На замки NFCKEY предоставляется ограниченная гарантия сроком в 1 год с момента приобретения, которая распространяется на дефекты материалов и изготовления. Подробную информацию о гарантии на конкретную модель замка NFCKEY вы можете узнать в документации к изделию или на нашем сайте.'
  },
  {
    value: 'item-17',
    title: 'На какую техническую поддержку замков NFCKEY я могу рассчитывать?',
    content:
      'NFCKEY стремится обеспечить постоянную техническую поддержку и оптимальную работу наших замков. Мы постоянно совершенствуем и улучшаем нашу систему с помощью обновлений программного обеспечения, чтобы предоставить вам самые последние функции и улучшения безопасности.'
  },
  {
    value: 'item-18',
    title: 'Какие варианты поддержки клиентов доступны, если мне потребуется помощь?',
    content:
      '<p>Мы ценим каждого клиента, поэтому будем рады помочь вам на каждом шагу. NFCKEY предлагает несколько вариантов поддержки клиентов:</p><ul><li>Наша компетентная служба поддержки готова помочь вам в решении любых вопросов и проблем. Вы можете связаться с нами через страницу контактов или каналы поддержки. Мы готовы ответить на ваши вопросы, оказать техническую помощь и дать рекомендации.</li><li>Каждый замок NFCKEY поставляется с полным руководством пользователя, содержащим пошаговые инструкции по установке, настройке и эксплуатации. Эти руководства являются источником информации для устранения неисправностей и понимания работы замка, а также помогут вам при непредвиденных ситуациях.</li></ul><p>Ваша удовлетворенность – наш главный приоритет, и мы обязуемся обеспечить поддержку, необходимую вам для максимальной отдачи от вашей системы NFCKEY. Если у вас есть вопросы по установке, эксплуатации или чему-либо еще, мы всегда готовы помочь.</p><br><p>Обратите внимание, что услуги поддержки для компаний и оптовых покупателей организованы индивидуально и определяются договором. Если вы представляете юридическое лицо и у вас есть конкретные вопросы или требования, мы рекомендуем вам обратиться к нашим специалистам по корпоративной поддержке, указанным на нашем сайте. Они будут рады помочь вам найти индивидуальные решения и варианты, отвечающие потребностям вашего бизнеса.</p>'
  },
  {
    value: 'item-19',
    title: 'Подходит ли NFCKEY для использования как в жилых, так и в коммерческих помещениях?',
    content:
      'Да, NFCKEY отличается универсальностью и адаптивностью, что позволяет использовать его в самых разных областях. Если вы хотите повысить безопасность и удобство вашего дома или нуждаетесь в надежном решении для контроля доступа на коммерческом объекте, NFCKEY сможет удовлетворить ваши потребности. Наши замки подходят как для жилых, так и для коммерческих помещений, обеспечивая одинаково высокий уровень безопасности и удобства независимо от сферы применения.'
  },
  {
    value: 'item-20',
    title: 'Могу ли я совершить оптовую закупку замков, представляя юридическое лицо?',
    content:
      'Для получения информации об оптовых заказах, ценах и возможностях персонализации, пожалуйста, посетите нашу специальную страницу для корпоративных и оптовых закупок. Вы найдете подробную информацию и контактные данные, которые помогут вам оставить заявку.'
  },
  {
    value: 'item-21',
    title: 'Смогу ли я сохранить доступ к своему помещению, если сядет батарея моего телефона?',
    content:
      'На случай непредвиденных ситуаций или проблем с батареей мы предлагаем использовать альтернативное решение в качестве физического ключа. Этот резервный метод входа гарантирует, что вы сможете войти в свое помещение даже при таких сценариях. Рекомендуем держать ключ вне помещения в безопасном месте, либо у людей, которым вы доверяете.'
  },
  {
    value: 'item-22',
    title: 'Что произойдет, если я потеряю свой телефон?',
    content:
      '<p>NFCKEY предусматривает меры, которые помогут вам восстановить доступ к вашему помещению в случае потери смартфона.</p><br><p>Первым делом как можно скорее свяжитесь с нашей службой поддержки. Они помогут вам отключить доступ к вашему замку с утерянного телефона и проведут вас через процесс перенастройки приложения NFCKEY на новом устройстве для повторного выпуска цифровых ключей.</p><br><p>Замки NFCKEY поставляются с альтернативным методом доступа в качестве физического ключа. Вы можете использовать это решение для доступа к своему помещению пока вы работаете над восстановлением или заменой потерянного телефона.</p><br><p>Тем не менее, мы рекомендуем предпринять меры по защите вашего смартфона и приложения, например, установив PIN-код или биометрическую защиту, чтобы предотвратить несанкционированный доступ в случае потери или кражи телефона.</p>'
  },
  {
    value: 'item-23',
    title: 'Могу ли я предоставить временный доступ гостям с помощью NFCKEY?',
    content:
      'Да, NFCKEY позволяет предоставлять временный доступ гостям или посетителям. С помощью нашего приложения вы можете легко создавать цифровые ключи с ограниченным сроком действия для гостей, предоставляя им доступ к вашему помещению.'
  },
  {
    value: 'item-24',
    title: 'Как я могу получать уведомления о входах и выходах?',
    content:
      '<p>Получение уведомлений о входах и выходах в режиме реального времени является одним из преимуществ использования NFCKEY. Вы можете настроить параметры уведомлений в соответствии со своими предпочтениями используя наше приложение. Перейдите в раздел “Настройки” > “Уведомления” и выберите необходимые параметры.</p><br><p>Следует уточнить, что для получения уведомлений потребуется наличие интернет-соединения на вашем устройстве.</p>'
  },
  {
    value: 'item-25',
    title: 'Могу ли я дистанционно управлять открытием и закрытием замка NFCKEY?',
    content:
      'Для NFCKEY безопасность является главным приоритетом. Мы решили не предоставлять дистанционное управление для открытия и закрытия замков, чтобы обеспечить максимальный уровень безопасности для наших пользователей. Такие опции могут создавать уязвимости, облегчая несанкционированный доступ. Сосредоточившись на технологии NFC и доступе с помощью смартфона, мы можем обеспечить более надежное и устойчивое к взлому решение для вашего спокойствия.'
  },
  {
    value: 'item-26',
    title: 'Как перейти на премиум-функции и преимущества NFCKEY?',
    content:
      '<p>Преимущества, предоставляемые премиум-подпиской, могут включать в себя дополнительные возможности контроля доступа, увеличение количества подключенных устройств, возможность персонализации аккаунтов и приложения, отключение нативной рекламы и другое. Чтобы перейти на премиальные функции и преимущества, выполните следующие простые действия в мобильном приложении NFCKEY:</p><ul><li>Перейдите к разделу "Подписка". Просмотрите доступные планы подписки и выберите тот, который лучше всего соответствует вашим потребностям. Вы можете выбрать месячный, годовой или другой срок действия подписки.</li><li>Следуя инструкциям на экране, завершите процесс оплаты выбранного плана подписки. Вам потребуется предоставить платежную информацию, например, данные кредитной карты, либо пройти оплату через доступные платежные шлюзы.</li><li>После подтверждения оплаты вы получите доступ к премиум-функциям и преимуществам, предлагаемым NFCKEY. Подписка автоматически продлевается после окончания ее срока. Посмотреть сведения о подписке и отключить продление вы сможете в этом же разделе.</li></ul><p>Следует помнить, что премиум-функции и преимущества могут варьироваться в зависимости от конкретного плана подписки. Обязательно ознакомьтесь с деталями тарифного плана, чтобы понять весь объем включенных в него возможностей. Если у вас возникнут вопросы или проблемы в процессе обновления, наша служба поддержки готова оказать вам помощь.</p>'
  },
  {
    value: 'item-27',
    title: 'Могу ли я интегрировать NFCKEY с существующей системой "умный дом"?',
    content:
      'На данный момент – нет, но мы планируем добавить поддержку интеграции NFCKEY с системами "умного дома" в будущих моделях. Такая интеграция позволит централизовать и управлять устройствами домашней автоматизации через единый интерфейс, обеспечивая еще больший контроль и удобство.'
  }
]
</script>

<template>
  <section>
    <div class="flex flex-col items-center gap-24">
      <div class="subtitle_ca">
        <h1 class="subtitle_ca__title subtitle_ca__title_gradient">Узнайте больше об NFCKEY</h1>
        <p class="subtitle_ca__text">
          Изучите раздел с часто задаваемыми вопросами и узнайте, как NFCKEY может органично
          вписаться в ваш образ жизни
        </p>
      </div>

      <Accordion type="multiple" class="faq-list" collapsible>
        <AccordionItem v-for="item in faqItems" :key="item.value" :value="item.value">
          <AccordionTrigger class="text-start">{{ item.title }}</AccordionTrigger>
          <AccordionContent>
            <div class="faq-list__content" v-html="item.content"></div>
          </AccordionContent>
        </AccordionItem>
      </Accordion>
    </div>
  </section>
</template>
